⚫️課題1−3
①32bit OSと64bit OSの違いは何ですか？

最大搭載可能メモリー。
32bit OSは4GBまで、64bit OSでは4GB以上（8GBや16GBなど）のメモリーを増設・使用することができる。

② メモリとは何ですか？また、その単位は何ですか？

データを記憶する部品のこと。
単位は、MBやGB。

③ メモリー数が大きいとどのようなメリットがありますか？

パソコンの動作速度があがる。


④ CPUとは何ですか？

コンピュータの主要な構成要素の一つで、他の装置・回路の制御やデータの演算などを行う装置。演算装置と制御装置を統合したもの。


⑤CPUのブランド名はどんな種類がありますか？

Intel社、AMD社
 
⑥CPUの性能を決める要素は何ですか？（3つ以上）

クロック周波数の速さ
コア数
スレッド数
処理の高速化を図る機能（Intel Turbo Boost Technology／AMD Turbo Core Technology）が搭載されているかどうか


⑦クロック数をシェフの記事で例えると、クロック数が1.0クロック→4.0クロックになるとシェフはどうなりますか？また単位はどんなものを使いますか？

動きが4倍になる。単位はHz（ヘルツ）を使う


⑧コア数をシェフの記事で例えるとコア数1→コア数4になるとシェフはどうなりますか？

シェフの数が1人から4人に増える


⑨スレッド数をシェフの記事で4スレッド→8スレッドになるとシェフはどうなりますか？

シェフ1人あたりに対して2つのコンロを使用できる。


⑩自分のPCのスペックを教えてください。

Windows 10 Home
Intel(R) Core(TM) i5-7200U CPU @ 2.50GHz   2.70 GHz
64 ビット オペレーティング システム、x64 ベース プロセッサ

⑪LinuxOSのメリットは何ですか？

セキュリティ性が高い
オープンソースである
自動で周辺機器に接続できる


⑫LinuxOSのデメリットは何ですか？

独特な操作に慣れるのが大変
メーカーからのサポートがない
自分に合ったLinuxを見つけるのが大変



⑬Linuxを学ぶのにおすすめの資格は何ですか？
○LPIC
○LinuC